---
kind: type
id: T:Autodesk.Revit.DB.OpeningWrappingCondition
source: html/f8e17ac3-c77b-f42c-88e8-2779daa726c7.htm
---
# Autodesk.Revit.DB.OpeningWrappingCondition

Used by CompoundStructure to describe which shell layers participate in wrapping at openings.

## Syntax (C#)
```csharp
public enum OpeningWrappingCondition
```